Catalogs/Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ХарактеристикиНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Б_ПрисоединенныеФайлыХарактеристикНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранимыйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() тогда
		
		Изменил 						= ПараметрыСеанса.ТекущийПользователь;
		ДатаМодификацииУниверсальная 	= ТекущаяДата();
		
	КонецЕсли;
	
	//Регистрируем изменение товаров	
	лОбъект = Владелец.Владелец.ПолучитьОбъект();
	лОбъект.Записать();
	
	//Регистрируем изменение характеристики	
	лОбъект = Владелец.ПолучитьОбъект();
	лОбъект.Записать();
	
КонецПроцедуры

Функция СоздатьНовыйПрисоединенныйФайл(ПараметрыФайла) Экспорт
																																																										
	лНовыйПрикрепленыйФайл = Справочники.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.СоздатьЭлемент();
	
	лНовыйПрикрепленыйФайл.Владелец 	= ПараметрыФайла.Владелец;
	
	лНовыйПрикрепленыйФайл.Наименование = ПараметрыФайла.Наименование;
	лНовыйПрикрепленыйФайл.ПутьКФайлу 	= ПараметрыФайла.ПутьКФайлу;
	лНовыйПрикрепленыйФайл.Расширение 	= ПараметрыФайла.Расширение;
	лНовыйПрикрепленыйФайл.Размер 		= ПараметрыФайла.Размер;
	
	лНовыйПрикрепленыйФайл.ДатаСоздания	= ТекущаяДата();
	лНовыйПрикрепленыйФайл.Автор 		= ПараметрыСеанса.ТекущийПользователь;	
	
	лНовыйПрикрепленыйФайл.Записать();
	
	//Регистрируем изменение характеристики	
	лОбъект = ПараметрыФайла.Владелец.ПолучитьОбъект();
	лОбъект.Записать();
	
	Возврат лНовыйПрикрепленыйФайл.Ссылка;
	
КонецФункции

Процедура ЗаписатьПрисоединенныйФайл(ПараметрыФайла) Экспорт
	
	НовЗапись = РегистрыСведений.Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.СоздатьМенеджерЗаписи();
	
	НовЗапись.ПрисоединенныйФайл 	= ПараметрыФайла.ПрисоединенныйФайл;		
	НовЗапись.ХранимыйФайл 			= Новый ХранилищеЗначения(Новый Картинка(ПараметрыФайла.ИмяФайла));		
	
	НовЗапись.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьКартинкуПоПрикрепленномуФайлу(ПрисоединенныйФайл) Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.ХранимыйФайл,
	|	Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.ПрисоединенныйФайл
	|ИЗ
	|	РегистрСведений.Б_ПрисоединенныеФайлыХарактеристикНоменклатуры КАК Б_ПрисоединенныеФайлыХарактеристикНоменклатуры
	|ГДЕ
	|	Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.ПрисоединенныйФайл = &ПрисоединенныйФайл";
	Запрос.УстановитьПараметр("ПрисоединенныйФайл", ПрисоединенныйФайл);
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Возврат Выборка.ХранимыйФайл.Получить();
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Неопределено;		
	
КонецФункции
